public class DemoRENEW {
    public static void main (String[] args){
        System.out.println("Task1:\n"+"Написать программу, которая находит наибольший общий делитель двух целых положительных чисел;\n" + "Введите числа НОД которых необходимо вычислить:");
        CommonDividerRENEW.main(null);
        System.out.println("Task2:\n"+ "Написать программу, которая находит сумму цифр произвольного целого числа;\n" + "Введите число, сумму цифр которого необходимо посчитать:");
        SumOfDigitsRENEW.main(null);
        System.out.println("Task3:\n" + "Написать программу проверки того, что заданное число Х – простое;\n" + "Введите число, чтоб определить простое оно или нет:");
        SimpleNumRENEW.main(null);
        System.out.println("Task4:\n" + "Сосчитать сумму ряда для заданного числа n > 0;\n" + "Введите число для которого необходимо сосчитать сумму ряда:");
        SumOfRowRENEW.main(null);
        System.out.println("Task5:\n" + "Подсчитать, сколько шестизначных цифр имеют равную сумму трех первых и трех последних цифр;");
        EqualityOfHalfsRENEW.main(null);
        System.out.println("Task6:\n" + "Разместить в памяти массив из 20 элементов и заполнить его рядом Фиббоначчи;");
        FibonachiRENEW.main(null);
        System.out.println("Task7:\n" + "Создать целый массив из 100 элементов и заполнить его простыми числами;");
        ArraySimpleNumRENEW.main(null);
        System.out.println("Task8:\n" + "Создать двумерный массив символов и заполнить его буквами 'Ч' и 'Б' в шахматном порядке;");
        DoubleArrayRENEW.main(null);
        System.out.println("Task9:\n" + "Создать целый шестимерный массив с двумя значениями в каждом измерении;");
        BigArrayRENEW.main(null);
        System.out.println("Task10:\n" + "Создать \"треугольный\" массив из 10 строк и заполнить его биномиальными коэффициентами;");
        TriangleArrayRENEW.main(null);
    }
}
